'use client'
import { animationLeft, animationRight } from "@/shared/const/animation";
import { Button } from "@/shared/ui/button/Button";
import { DefaultBtn } from "@/shared/ui/button/DefaultBtn";
import { motion } from "framer-motion";
import { useState } from "react";

export const ExchangeWallet = () => {
  const [walletAddress, setWalletAddress] = useState<string | null>('YGyBG8YgdjKLGyBG8YgdjKLGyBG8YgdjKLGyBG8YgdjKLGyBG8YgdjKLGyBG8YgdjKLGyBG8YgdjKLGyBG8YgdjKLGyBG8YgdjKL')

  return (
    <>
      <motion.div {...animationRight} className="flex items-center justify-center p-[2.6vw] m-[4vw_0px]">
        <h2 className="fs-17 font-semibold">Обменник</h2>
      </motion.div>
      <motion.div {...animationLeft} className="p-[0px_5.5vw] mb-[10vw]">
        {walletAddress
          ? (
            <DefaultBtn onClick={() => navigator.clipboard.writeText(walletAddress)}>
              <div className="flex items-center justify-center gap-[3vw]">
                <p className="font-medium fs-15">{walletAddress.slice(0, 8) + "...." + walletAddress.slice(-4)}</p>
                <svg className="w-21px h-21px opacity-50" width="21" height="21" viewBox="0 0 21 21" fill="none" xmlns="http://www.w3.org/2000/svg">
                  <path d="M7.63219 15.8581H5.50819C4.08716 15.8581 2.72433 15.2936 1.71951 14.2888C0.71469 13.2839 0.150188 11.9211 0.150188 10.5001C0.150188 9.07906 0.71469 7.71623 1.71951 6.71141C2.72433 5.70659 4.08716 5.14209 5.50819 5.14209H7.63219C7.8311 5.14209 8.02187 5.22111 8.16252 5.36176C8.30317 5.50241 8.38219 5.69318 8.38219 5.89209C8.38219 6.091 8.30317 6.28177 8.16252 6.42242C8.02187 6.56307 7.8311 6.64209 7.63219 6.64209H5.50819C4.48498 6.64209 3.50369 7.04856 2.78017 7.77207C2.05666 8.49559 1.65019 9.47689 1.65019 10.5001C1.65019 11.5233 2.05666 12.5046 2.78017 13.2281C3.50369 13.9516 4.48498 14.3581 5.50819 14.3581H7.63219C8.65491 14.3565 9.63528 13.9495 10.3585 13.2264C11.0816 12.5032 11.4886 11.5228 11.4902 10.5001C11.4902 10.3012 11.5692 10.1104 11.7099 9.96976C11.8505 9.82911 12.0413 9.75009 12.2402 9.75009C12.4391 9.75009 12.6299 9.82911 12.7705 9.96976C12.9112 10.1104 12.9902 10.3012 12.9902 10.5001C12.9886 11.9206 12.4236 13.2825 11.4191 14.287C10.4146 15.2915 9.05273 15.8565 7.63219 15.8581Z" fill="white"/>
                  <path d="M15.4921 15.8581H13.3681C13.1692 15.8581 12.9784 15.7791 12.8378 15.6384C12.6971 15.4978 12.6181 15.307 12.6181 15.1081C12.6181 14.9092 12.6971 14.7184 12.8378 14.5778C12.9784 14.4371 13.1692 14.3581 13.3681 14.3581H15.4921C16.5153 14.3581 17.4966 13.9516 18.2201 13.2281C18.9436 12.5046 19.3501 11.5233 19.3501 10.5001C19.3501 9.47689 18.9436 8.49559 18.2201 7.77207C17.4966 7.04856 16.5153 6.64209 15.4921 6.64209H13.3681C12.3454 6.64368 11.365 7.05065 10.6418 7.77383C9.91867 8.497 9.5117 9.47737 9.51011 10.5001C9.51011 10.699 9.43109 10.8898 9.29044 11.0304C9.14979 11.1711 8.95902 11.2501 8.76011 11.2501C8.5612 11.2501 8.37043 11.1711 8.22978 11.0304C8.08913 10.8898 8.01011 10.699 8.01011 10.5001C8.0117 9.07955 8.57671 7.71764 9.58118 6.71317C10.5857 5.70869 11.9476 5.14368 13.3681 5.14209H15.4921C16.9131 5.14209 18.276 5.70659 19.2808 6.71141C20.2856 7.71623 20.8501 9.07906 20.8501 10.5001C20.8501 11.9211 20.2856 13.2839 19.2808 14.2888C18.276 15.2936 16.9131 15.8581 15.4921 15.8581Z" fill="white"/>
                </svg>
              </div>
            </DefaultBtn>
          )
          : <Button onClick={() => {}}>Подключить кошелек</Button>
        }
      </motion.div>
    </>
  );
};